In [1]:
import pandas as pd

#### Pandas Series

In [3]:
# create a Series
ser = pd.Series([3, 4, 5, 6, 7, 8, 9])
ser

0    3
1    4
2    5
3    6
4    7
5    8
6    9
dtype: int64

In [4]:
ser2 = pd.Series(['Apple', 'Mango', 'Banana', 'Grape'])
ser2

0     Apple
1     Mango
2    Banana
3     Grape
dtype: object

In [5]:
ser2[2]

'Banana'

In [6]:
ser2[2:4]

2    Banana
3     Grape
dtype: object

In [9]:
ser3 = pd.Series([1, 2, 3, 4, 5], index=['r1', 'r2', 'r3', 'r4', 'r5'])
ser3

r1    1
r2    2
r3    3
r4    4
r5    5
dtype: int64

In [10]:
ser3[2] = 4

In [11]:
ser3

r1    1
r2    2
r3    4
r4    4
r5    5
dtype: int64

In [12]:
## Series is mutable

### DataFrame

In [29]:
df = pd.read_csv('mtcars.csv')

In [15]:
df.head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   model   32 non-null     object
 1   mpg     32 non-null     float64
 2   cyl     32 non-null     int64
 3   disp    32 non-null     float64
 4   hp      32 non-null     int64
 5   drat    32 non-null     float64
 6   wt      32 non-null     float64
 7   qsec    32 non-null     float64
 8   vs      32 non-null     int64
 9   am      32 non-null     int64
 10  gear    32 non-null     int64
 11  carb    32 non-null     int64
dtypes: float64(5), int64(6), object(1)
memory usage: 3.1+ KB

In [17]:
df.describe()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

In [19]:
df.shape

(32, 12)

In [18]:
df.isna().sum()

model    0
mpg      0
cyl      0
disp     0
hp       0
drat     0
wt       0
qsec     0
vs       0
am       0
gear     0
carb     0
dtype: int64

In [22]:
df.mpg # or df['mpg']

0     21.0
1     21.0
2     22.8
3     21.4
4     18.7
5     18.1
6     14.3
7     24.4
8     22.8
9     19.2
10    17.8
11    16.4
12    17.3
13    15.2
14    10.4
15    10.4
16    14.7
17    32.4
18    30.4
19    33.9
20    21.5
21    15.5
22    15.2
23    13.3
24    19.2
25    27.3
26    26.0
27    30.4
28    15.8
29    19.7
30    15.0
31    21.4
Name: mpg, dtype: float64

In [30]:
# create a DF

df1 = pd.DataFrame([[1, 2, 3, 4, 5], [2, 3, 4, 5, 6], [6, 7, 8, 9, 10]])

In [31]:
df1

   0  1  2  3   4
0  1  2  3  4   5
1  2  3  4  5   6
2  6  7  8  9  10

In [35]:
df1.columns = ['A', 'B', 'C', 'D', 'E']

In [36]:
df1

   A  B  C  D   E
0  1  2  3  4   5
1  2  3  4  5   6
2  6  7  8  9  10

In [40]:
df1['F'] = [6, np.nan, None]

In [41]:
df1

   A  B  C  D   E    F
0  1  2  3  4   5  6.0
1  2  3  4  5   6  NaN
2  6  7  8  9  10  NaN

In [43]:
df1.drop('F', axis=1, inplace=True)

In [44]:
df1

   A  B  C  D   E
0  1  2  3  4   5
1  2  3  4  5   6
2  6  7  8  9  10

In [48]:
df.iloc[3]

model    Hornet 4 Drive
mpg                21.4
cyl                   6
disp              258.0
hp                  110
drat               3.08
wt                3.215
qsec              19.44
vs                    1
am                    0
gear                  3
carb                  1
Name: 3, dtype: object

In [49]:
df.loc[3]

model    Hornet 4 Drive
mpg                21.4
cyl                   6
disp              258.0
hp                  110
drat               3.08
wt                3.215
qsec              19.44
vs                    1
am                    0
gear                  3
carb                  1
Name: 3, dtype: object